#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#define RUS_CHARS_COUNT 33

// спасибо за скрипт: echo "А..Яа..яЁё" | hexdump -C
static const unsigned char utf8_RU[33*2][2] = {
  // верхний регистр

  // байты кодирующие символ в UTF-8
  //              // индекс в массиве - номер буквы в русском алфавите без Ё (нумерация с 0 до 31)
  { 0xd0, 0x90 }, // А 0x00
  { 0xd0, 0x91 }, // Б 0x01
  { 0xd0, 0x92 }, // В 0x02
  { 0xd0, 0x93 }, // Г 0x03
  { 0xd0, 0x94 }, // Д 0x04
  { 0xd0, 0x95 }, // Е 0x05
  { 0xd0, 0x96 }, // Ж 0x06
  { 0xd0, 0x97 }, // З 0x07
  { 0xd0, 0x98 }, // И 0x08
  { 0xd0, 0x99 }, // Й 0x09
  { 0xd0, 0x9a }, // К 0x0A
  { 0xd0, 0x9b }, // Л 0x0B
  { 0xd0, 0x9c }, // М 0x0C
  { 0xd0, 0x9d }, // Н 0x0D
  { 0xd0, 0x9e }, // О 0x0E
  { 0xd0, 0x9f }, // П 0x0F
  { 0xd0, 0xa0 }, // Р 0x10
  { 0xd0, 0xa1 }, // С 0x11
  { 0xd0, 0xa2 }, // Т 0x12
  { 0xd0, 0xa3 }, // У 0x13
  { 0xd0, 0xa4 }, // Ф 0x14
  { 0xd0, 0xa5 }, // Х 0x15
  { 0xd0, 0xa6 }, // Й 0x16
  { 0xd0, 0xa7 }, // Ч 0x17
  { 0xd0, 0xa8 }, // Ш 0x18
  { 0xd0, 0xa9 }, // Щ 0x19
  { 0xd0, 0xaa }, // Ъ 0x1A
  { 0xd0, 0xab }, // Ы 0x1B
  { 0xd0, 0xac }, // Ь 0x1C
  { 0xd0, 0xad }, // Э 0x1D
  { 0xd0, 0xae }, // Ю 0x1E
  { 0xd0, 0xaf }, // Я 0x1F

  // нижний регистр

  // байты кодирующие символ в UTF-8
  { 0xd0, 0xb0 }, // а 0x20
  { 0xd0, 0xb1 }, // б 0x21
  { 0xd0, 0xb2 }, // в 0x22
  { 0xd0, 0xb3 }, // г 0x23
  { 0xd0, 0xb4 }, // д 0x24
  { 0xd0, 0xb5 }, // е 0x25
  { 0xd0, 0xb6 }, // ж 0x26
  { 0xd0, 0xb7 }, // з 0x27
  { 0xd0, 0xb8 }, // и 0x28
  { 0xd0, 0xb9 }, // й 0x29
  { 0xd0, 0xba }, // к 0x2A
  { 0xd0, 0xbb }, // л 0x2B
  { 0xd0, 0xbc }, // м 0x2C
  { 0xd0, 0xbd }, // н 0x2D
  { 0xd0, 0xbe }, // о 0x2E
  { 0xd0, 0xbf }, // п 0x2F
  { 0xd1, 0x80 }, // р 0x30
  { 0xd1, 0x81 }, // с 0x31
  { 0xd1, 0x82 }, // т 0x32
  { 0xd1, 0x83 }, // у 0x33
  { 0xd1, 0x84 }, // ф 0x34
  { 0xd1, 0x85 }, // х 0x35
  { 0xd1, 0x86 }, // ц 0x36
  { 0xd1, 0x87 }, // ч 0x37
  { 0xd1, 0x88 }, // ш 0x38
  { 0xd1, 0x89 }, // щ 0x39
  { 0xd1, 0x8a }, // ъ 0x3A
  { 0xd1, 0x8b }, // ы 0x3B
  { 0xd1, 0x8c }, // ь 0x3D
  { 0xd1, 0x8d }, // э 0x3C
  { 0xd1, 0x8e }, // ю 0x3E
  { 0xd1, 0x8f }, // я 0x3F
  // Буквы Ё и ё
  { 0xd0, 0x81 }, // Ё 0x40
  { 0xd1, 0x91 }, // ё 0x41
};


// КЛЮЧ:
//   <БАЙТ В ИСХОДНОЙ КОДИРОВКЕ>
// ЗНАЧЕНИЕ:
//   <-1>           ПРЕОБРАЗОВАНИЕ НЕ ТРЕБУЕТСЯ
//   <НОМЕР ПАРЫ>   ИНДЕКС ПАРЫ ИЗ МАССИВА utf8_RU
static const char map_cp1251    [256] = 
{
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,//  ☺☻♥♦♣♠•◘○◙♂♀♪♫☼
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ►◄↕‼¶§▬↨↑↓→←∟↔▲▼
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,//  !"#$%&'()*+,-./
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// 0123456789:;<=>?
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// @ABCDEFGHIJKLMNO
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// PQRSTUVWXYZ[\]^_
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// `abcdefghijklmno
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// pqrstuvwxyz{|}~⌂
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ЂЃ‚ѓ„…†‡€‰Љ‹ЊЌЋЏ
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ђ‘’“”•–—�™љ›њќћџ
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,0x40,  -1,  -1,  -1,  -1,  -1,  -1,  -1,//  ЎўЈ¤Ґ¦§Ё©Є«¬�®Ї
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,0x41,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// °±Ііґµ¶·ё№є»јЅѕї
  0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x0F,// АБВГДЕЖЗИЙКЛМНОП
  0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1A,0x1B,0x1C,0x1D,0x1E,0x1F,// РСТУФХЦЧШЩЪЫЬЭЮЯ
  0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27,0x28,0x29,0x2A,0x2B,0x2C,0x2D,0x2E,0x2F,// абвгдежзийклмноп
  0x30,0x31,0x32,0x33,0x34,0x35,0x36,0x37,0x38,0x39,0x3A,0x3B,0x3C,0x3D,0x3E,0x3F,// рстуфхцчшщъыьэюя
};

static const char map_koi8r     [256] =
{
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,//  ☺☻♥♦♣♠•◘○◙♂♀♪♫☼
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ►◄↕‼¶§▬↨↑↓→←∟↔▲▼
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,//  !"#$%&'()*+,-./
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// 0123456789:;<=>?
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// @ABCDEFGHIJKLMNO
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// PQRSTUVWXYZ[\]^_
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// `abcdefghijklmno
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// pqrstuvwxyz{|}~⌂
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ─│┌┐└┘├┤┬┴┼▀▄█▌▐
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ░▒▓⌠■∙√≈≤≥ ⌡°²·÷
    -1,  -1,  -1,0x41,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ═║╒ё╓╔╕╖╗╘╙╚╛╜╝╞
    -1,  -1,  -1,0x40,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ╟╠╡Ё╢╣╤╥╦╧╨╩╪╫╬©
  0x3E,0x20,0x21,0x36,0x24,0x25,0x34,0x23,0x35,0x28,0x29,0x2A,0x2B,0x2C,0x2D,0x2E,// юабцдефгхийклмно
  0x2F,0x3F,0x30,0x31,0x32,0x33,0x26,0x22,0x3C,0x3B,0x27,0x38,0x3D,0x39,0x37,0x3A,// пярстужвьызшэщчъ
  0x1E,0x00,0x01,0x16,0x04,0x05,0x14,0x03,0x15,0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,// ЮАБЦДЕФГХИЙКЛМНО
  0x0F,0x1F,0x10,0x11,0x12,0x13,0x06,0x02,0x1C,0x1B,0x07,0x18,0x1D,0x19,0x17,0x1A,// ПЯРСТУЖВЬЫЗШЭЩЧЪ
};

static const char map_iso8859_5[256]=
{
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ☺☻♥♦♣♠•◘○◙♂♀♪♫☼
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ►◄↕‼¶§▬↨↑↓→←∟↔▲▼
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,//  !"#$%&'()*+,-./
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// 0123456789:;<=>?
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// @ABCDEFGHIJKLMNO
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// PQRSTUVWXYZ[\]^_
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// `abcdefghijklmno
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// pqrstuvwxyz{|}~⌂
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ����������������
    -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// ����������������
    -1,0x40,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,//  ЁЂЃЄЅІЇЈЉЊЋЌ�ЎЏ
  0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x0F,// АБВГДЕЖЗИЙКЛМНОП
  0x10,0x11,0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1A,0x1B,0x1C,0x1D,0x1E,0x1F,// РСТУФХЦЧШЩЪЫЬЭЮЯ
  0x20,0x21,0x22,0x23,0x24,0x25,0x26,0x27,0x28,0x29,0x2A,0x2B,0x2C,0x2D,0x2E,0x2F,// абвгдежзийклмноп
  0x30,0x31,0x32,0x33,0x34,0x35,0x36,0x37,0x38,0x39,0x3A,0x3B,0x3C,0x3D,0x3E,0x3F,// рстуфхцчшщъыьэюя
    -1,0x41,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,  -1,// №ёђѓєѕіїјљњћќ§ўџ
};


// список поддерживаемых кодировок
const char *encodings [] = {
  "CP-1251",
  "KOI8-R",
  "ISO-8859-5",
};
#define ENCODING_COUNT ( sizeof(encodings) / sizeof(encodings[0]) )

int main(int argc, char** argv)
{
  if(argc != 4)
  {
    fprintf( stderr,
             "USAGE: %s <input-file> <output-UTF8-file> <input-encoding>\n"
             "       <input-encoding> is CP-1251,KOI8-R or ISO-8859-5\n",
             argv[0] );

    return EXIT_FAILURE;
  }

  // До обращения к файлам - проверим заданную кодировку
  unsigned int enc_idx;
  for( enc_idx = 0 ; enc_idx < (unsigned int)ENCODING_COUNT ; enc_idx++ )
  {
    if( strcmp( encodings[ enc_idx ], argv[3] ) == 0 ) // если кодировка найдена, выходим
      break;
  }
  // если прошли весь массив, то известная (поддерживаемая) кодировка не найдена
  if( enc_idx == (unsigned int)ENCODING_COUNT )
  {
    fprintf( stderr, "Encoding '%s' are not supported!\n", argv[3] );
    return EXIT_FAILURE; // к файлам даже не пытаемся обращаться
  }

  // пытаемся открыть входной файл с текстом в исходной кодировке на чтение
  FILE* file = fopen(argv[1], "rb");
  if(!file)
  {
    fprintf( stderr, "Failed to open %s for reading!\n", argv[1] );
    return EXIT_FAILURE;
  }

  // пытаемся открыть выходной файл для записи (сохранять в UTF-8)
  FILE* fout = fopen( argv[2], "wb" );
  if(!fout)
  {
    fprintf( stderr, "Failed to open %s for writing!\n", argv[1] );
    // закрываем также и входной файл
    fclose(file);
    return EXIT_FAILURE;
  }

  // fseek( file, 0, SEEK_SET );
  // побайтовая обработка
  while( ! feof(file) )
  {
    char ibuff[1];

    size_t ret = 0;
    ret = fread(&ibuff[0], 1, 1, file);
    if (ret != 1)
      break; // ошибка или достигли конца файла

    char char_idx = -1;
    switch( enc_idx )
    {
      case 0:
        char_idx = map_cp1251   [ (unsigned char)ibuff[0] ];
        break;
      case 1:
        char_idx = map_koi8r    [ (unsigned char)ibuff[0] ];
        break;
      case 2:
        char_idx = map_iso8859_5[ (unsigned char)ibuff[0] ];
        break;
      default:
        break;
    }

    if( char_idx == -1 ) { // нет преобразования
      ret = fwrite( ibuff, 1, 1, fout ); // зеркалируем как есть
      if( ret != 1 ) break; // если не записан 1 байт, то прерываем цикл
    }
    else
    {
      ret=fwrite( &utf8_RU[ (unsigned char)char_idx ][ 0 ], 1, 2, fout ); // печатаем оттуда пару байт для кириллического символа
      if( ret != 2 ) break; // если не записано 2 байта, то прерываем цикл
    }
  }

  fclose( file );
  fclose( fout );

  return EXIT_SUCCESS;
}
